src/Documents/Вылеты/Вылеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вылеты</name>
  <registerRecords>AccumulationRegister.ДанныеВылетов</registerRecords>
  <attributes>
    <name>ОтправлениеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРуления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВзлета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеВКП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>КВС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрктикаТ1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправленоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрктикаТ4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадержкаВылета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаВылета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевылета</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВСуточныйПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКресел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеОбслуживания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СвязьДанныеСОППрилетВылет/СвязьДанныеСОППрилетВылет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьДанныеСОППрилетВылет</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПрилетВылет</name>
    <type>
      <types>DocumentRef.Прилеты</types>
      <types>DocumentRef.Вылеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КоличествоКреселБортов/КоличествоКреселБортов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоличествоКреселБортов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоКресел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Вылеты/Forms/ФормаДокумента/Module.bsl
#Область ВспомогательныеФункции

&НаСервере
Функция  ДанныеРейса(Рейс)
	Выборка = Новый Структура;
	Если (Рейс.АэропортВылета = Справочники.Аэропорты.ПустаяСсылка()) и (Рейс.АэропортПрилета = Справочники.Аэропорты.ПустаяСсылка()) Тогда 
		Выборка.Вставить("Успех", Ложь);
		Выборка.Вставить("Код", -2);
		Выборка.Вставить("АэропортПрилета", Справочники.Аэропорты.ПустаяСсылка());
		Выборка.Вставить("АэропортВылета", Справочники.Аэропорты.ПустаяСсылка());
	ИначеЕсли (Рейс.АэропортВылета = Справочники.Аэропорты.ПустаяСсылка()) или (Рейс.АэропортПрилета = Справочники.Аэропорты.ПустаяСсылка()) Тогда	
		Выборка.Вставить("Успех", Ложь);
		Выборка.Вставить("Код", -1);
		Выборка.Вставить("АэропортПрилета", Справочники.Аэропорты.ПустаяСсылка());
		Выборка.Вставить("АэропортВылета", Справочники.Аэропорты.ПустаяСсылка());
	Иначе 
		Выборка.Вставить("Успех", Истина);
		Выборка.Вставить("АэропортПрилета", Рейс.АэропортПрилета);
		Выборка.Вставить("АэропортВылета", Рейс.АэропортВылета);	
	КонецЕсли;
	Возврат Выборка;
КонецФункции

&НаСервере
Функция ПолучитьГраницуЗапретаИзменений()
	Возврат Константы.ГраницаЗапретаИзменений.Получить()	
КонецФункции

#КонецОбласти

#Область ПроцедурыИзменяющиеЭлементыФормы

&НаСервере
Процедура ПолучитьДанныеСОПНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязьДанныеСОППрилетВылет.ПассажирыВзрослые КАК ПассажирыВзрослые,
		|	СвязьДанныеСОППрилетВылет.ПассажирыДети КАК ПассажирыДети,
		|	СвязьДанныеСОППрилетВылет.ПассажирыМалыши КАК ПассажирыМалыши,
		|	СвязьДанныеСОППрилетВылет.РучнаяКладь КАК РучнаяКладь,
		|	СвязьДанныеСОППрилетВылет.Багаж КАК Багаж,
		|	СвязьДанныеСОППрилетВылет.Почта КАК Почта,
		|	СвязьДанныеСОППрилетВылет.Груз КАК Груз,
		|	СвязьДанныеСОППрилетВылет.VIPПассажирыВзрослые КАК VIPПассажирыВзрослые,
		|	СвязьДанныеСОППрилетВылет.VIPПассажирыДети КАК VIPПассажирыДети
		|ИЗ
		|	РегистрСведений.СвязьДанныеСОППрилетВылет КАК СвязьДанныеСОППрилетВылет
		|ГДЕ
		|	СвязьДанныеСОППрилетВылет.ПрилетВылет = &ПрилетВылет";
	
	Запрос.УстановитьПараметр("ПрилетВылет", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Диспетчер СОП еще не ввел данные по этому документу";
		Сообщение.Сообщить();
	Иначе 
		ВыборкаДетальныеЗаписи.Следующий();
		Объект.ПассажирыВзрослые = ВыборкаДетальныеЗаписи.ПассажирыВзрослые;
		Объект.ПассажирыДети = ВыборкаДетальныеЗаписи.ПассажирыДети;
		Объект.ПассажирыМалыши = ВыборкаДетальныеЗаписи.ПассажирыМалыши;
		Объект.Почта = ВыборкаДетальныеЗаписи.Почта;
		Объект.Груз = ВыборкаДетальныеЗаписи.Груз;
		Объект.РучнаяКладь = ВыборкаДетальныеЗаписи.РучнаяКладь;
		Объект.Багаж = ВыборкаДетальныеЗаписи.Багаж;
		Объект.VIPПассажирыВзрослые = ВыборкаДетальныеЗаписи.VIPПассажирыВзрослые;
		Объект.VIPПассажирыДети = ВыборкаДетальныеЗаписи.VIPПассажирыДети;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данные успешно загружены";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СравнитьДанныеСДаннымиСОП() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязьДанныеСОППрилетВылет.ПассажирыВзрослые КАК ПассажирыВзрослые,
		|	СвязьДанныеСОППрилетВылет.ПассажирыДети КАК ПассажирыДети,
		|	СвязьДанныеСОППрилетВылет.ПассажирыМалыши КАК ПассажирыМалыши,
		|	СвязьДанныеСОППрилетВылет.РучнаяКладь КАК РучнаяКладь,
		|	СвязьДанныеСОППрилетВылет.Багаж КАК Багаж,
		|	СвязьДанныеСОППрилетВылет.Почта КАК Почта,
		|	СвязьДанныеСОППрилетВылет.Груз КАК Груз,
		|	СвязьДанныеСОППрилетВылет.VIPПассажирыВзрослые КАК VIPПассажирыВзрослые,
		|	СвязьДанныеСОППрилетВылет.VIPПассажирыДети КАК VIPПассажирыДети
		|ИЗ
		|	РегистрСведений.СвязьДанныеСОППрилетВылет КАК СвязьДанныеСОППрилетВылет
		|ГДЕ
		|	СвязьДанныеСОППрилетВылет.ПрилетВылет = &ПрилетВылет";
	
	Запрос.УстановитьПараметр("ПрилетВылет", объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура;
	
	Если не РезультатЗапроса.Пустой() Тогда 
		ВыборкаДетальныеЗаписи.Следующий();
		ОтличаетсяОтДанныхСоп = Ложь;
		Если (Объект.ПассажирыВзрослые <> ВыборкаДетальныеЗаписи.ПассажирыВзрослые) или (Объект.ПассажирыДети <> ВыборкаДетальныеЗаписи.ПассажирыДети)
			или (Объект.ПассажирыМалыши <> ВыборкаДетальныеЗаписи.ПассажирыМалыши) или (Объект.Почта <> ВыборкаДетальныеЗаписи.Почта) или (Объект.Груз <> ВыборкаДетальныеЗаписи.Груз)
			или (Объект.РучнаяКладь <> ВыборкаДетальныеЗаписи.РучнаяКладь)или (Объект.Багаж <> ВыборкаДетальныеЗаписи.Багаж) или (Объект.VIPПассажирыВзрослые <> ВыборкаДетальныеЗаписи.VIPПассажирыВзрослые)
			или (Объект.VIPПассажирыДети <> ВыборкаДетальныеЗаписи.VIPПассажирыДети)
			Тогда
			ОтличаетсяОтДанныхСоп = Истина;
		КонецЕсли;
		СтруктураДанных.Вставить("ОтличаетсяОтДанныхСоп",ОтличаетсяОтДанныхСоп);
		Если ОтличаетсяОтДанныхСоп Тогда
			СтруктураДанных.Вставить("ПассажирыВзрослые",ВыборкаДетальныеЗаписи.ПассажирыВзрослые);
			СтруктураДанных.Вставить("ПассажирыДети",ВыборкаДетальныеЗаписи.ПассажирыДети);
			СтруктураДанных.Вставить("ПассажирыМалыши",ВыборкаДетальныеЗаписи.ПассажирыМалыши);
			СтруктураДанных.Вставить("Почта",ВыборкаДетальныеЗаписи.Почта);
			СтруктураДанных.Вставить("Груз",ВыборкаДетальныеЗаписи.Груз);
			СтруктураДанных.Вставить("РучнаяКладь",ВыборкаДетальныеЗаписи.РучнаяКладь);
			СтруктураДанных.Вставить("Багаж",ВыборкаДетальныеЗаписи.Багаж);
			СтруктураДанных.Вставить("VIPПассажирыВзрослые",ВыборкаДетальныеЗаписи.VIPПассажирыВзрослые);
			СтруктураДанных.Вставить("VIPПассажирыДети",ВыборкаДетальныеЗаписи.VIPПассажирыДети);
		КонецЕсли;		
	КонецЕсли;
	
	Возврат СтруктураДанных;
КонецФункции	

&НаКлиенте 
Процедура ЗадатьВопрос(Структура) 
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект, Структура); // Прописываем название процедуры-обработчика. 
	ПоказатьВопрос(Оповещение, "Изменить значения?", // вместо привычного "Вопрос", теперь "ПоказатьВопрос" 
	РежимДиалогаВопрос.ДаНет, 0, // задержка (секунды). необязательно 
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно 
	"ДАННЫЕ СОП ДЛЯ ЭТОГО ДОКУМЕНТА ОТЛИЧАЮТСЯ" // устанавливаем заголовок. необязательно
	); 
КонецПроцедуры 

&НаКлиенте 
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Объект.ПассажирыВзрослые = Параметры.ПассажирыВзрослые;
		Объект.ПассажирыДети = Параметры.ПассажирыДети;
		Объект.ПассажирыМалыши = Параметры.ПассажирыМалыши;
		Объект.Почта = Параметры.Почта;
		Объект.Груз = Параметры.Груз;
		Объект.РучнаяКладь = Параметры.РучнаяКладь;
		Объект.Багаж = Параметры.Багаж;
		Объект.VIPПассажирыВзрослые = Параметры.VIPПассажирыВзрослые;
		Объект.VIPПассажирыДети = Параметры.VIPПассажирыДети;
		
		Сообщить("Данные успешно изменены"); 
	Иначе 
		Сообщить("Данные остались прежними"); 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗадержкаВылетаПриИзменении(Элемент)
	Если Объект.ЗадержкаВылета Тогда
		Элементы.ПричинаЗадержки.Доступность = Истина;
	Иначе 
		Элементы.ПричинаЗадержки.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВылетаПриИзменении(Элемент)
	Если Объект.ОтменаВылета Тогда
		Элементы.ПричинаНевылета.Доступность = Истина;
	Иначе 
		Элементы.ПричинаНевылета.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементов

&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	Стр = ДанныеРейса(Объект.Рейс);
	Если Стр.Успех Тогда 
		Объект.АэропортВылета = Стр.АэропортВылета;
		Объект.АэропортПрилета = Стр.АэропортПрилета;
		Элементы.АэропортВылета.Доступность = Ложь;
		Элементы.АэропортПрилета.Доступность = Ложь;		
	ИначеЕсли (не Стр.Успех) и (Стр.Код = -2) Тогда 
		Элементы.АэропортВылета.Доступность = Истина;
		Элементы.АэропортПрилета.Доступность = Истина;
		Элементы.АэропортВылета.ОтметкаНезаполненного = Истина;
		Элементы.АэропортПрилета.ОтметкаНезаполненного = Истина;
		Объект.АэропортВылета = Стр.АэропортВылета;
		Объект.АэропортПрилета = Стр.АэропортПрилета;
	Иначе 	
		Элементы.АэропортВылета.Доступность = Истина;
		Элементы.АэропортПрилета.Доступность = Истина;
		Элементы.АэропортВылета.ОтметкаНезаполненного = Истина;
		Элементы.АэропортПрилета.ОтметкаНезаполненного = Истина;
		Объект.АэропортВылета = Стр.АэропортВылета;
		Объект.АэропортПрилета = Стр.АэропортПрилета;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У рейса заполнен только 1 а/п. Должны быть заполнены либо оба, либо ни одного!";
		Сообщение.Поле = "Рейс";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСОП(Команда)
	ПолучитьДанныеСОПНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерБортаПриИзмененииНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоКреселБортовСрезПоследних.КоличествоКресел КАК КоличествоКресел
		|ИЗ
		|	РегистрСведений.КоличествоКреселБортов.СрезПоследних(&Дата, НомерБорта = &НомерБорта) КАК КоличествоКреселБортовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("НомерБорта", Объект.НомерБорта);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Объект.КоличествоКресел = Объект.ТипВС.КоличествоКресел;			
	Иначе
		Результат = Запрос.Выполнить().Выбрать();	
		Результат.Следующий();
		Объект.КоличествоКресел = Результат.КоличествоКресел;
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерБортаПриИзменении(Элемент)
	НомерБортаПриИзмененииНаСервере();
КонецПроцедуры 

#КонецОбласти

#Область ГлобальныеСобытия

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СтруктураДанныхСОП = СравнитьДанныеСДаннымиСОП();
	
	Если СтруктураДанныхСОП.Свойство("ОтличаетсяОтДанныхСоп") Тогда 
		Если СтруктураДанныхСОП.ОтличаетсяОтДанныхСоп Тогда 
			Отказ = Истина;
			ЗадатьВопрос(СтруктураДанныхСОП);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПолучитьГраницуЗапретаИзменений() >= Объект.Дата Тогда 
		ЭтаФорма.ТолькоПросмотр = истина;
		Элементы.РедактированиеЗапрещено.Видимость = Истина;
		РедактированиеЗапрещено = "Редактирование данного периода запрещено";
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
